<p style="text-align:center">
    <a href="https://skills.network/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork865-2022-01-01" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo"  />
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [1]:
!pip install sqlalchemy==1.3.9

Collecting sqlalchemy==1.3.9
  Downloading SQLAlchemy-1.3.9.tar.gz (6.0 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 6.0/6.0 MB 50.3 MB/s eta 0:00:0000:0100:01m
  Preparing metadata (setup.py) ... done
Building wheels for collected packages: sqlalchemy
  Building wheel for sqlalchemy (setup.py) ... done
  Created wheel for sqlalchemy: filename=SQLAlchemy-1.3.9-cp37-cp37m-linux_x86_64.whl size=1159121 sha256=d8dc5d3a8bfd15769a6cb81953a258f8b4f0cf12eb94eb39eac63b6737a476cf
  Stored in directory: /home/jupyterlab/.cache/pip/wheels/03/71/13/010faf12246f72dc76b4150e6e599d13a85b4435e06fb9e51f
Successfully built sqlalchemy
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.3.24
    Uninstalling SQLAlchemy-1.3.24:
      Successfully uninstalled SQLAlchemy-1.3.24
Successfully installed sqlalchemy-1.3.9

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [2]:
%load_ext sql

In [3]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [4]:
!pip install -q pandas==1.1.5

In [5]:
%sql sqlite:///my_data1.db

'Connected: @my_data1.db'

In [6]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

/home/jupyterlab/conda/envs/python/lib/python3.7/site-packages/pandas/core/generic.py:2882: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  both result in 0.1234 being formatted as 0.12.

In [7]:
%sql SELECT name,type,length(type) FROM PRAGMA_TABLE_INFO('SPACEXTBL');

 * sqlite:///my_data1.db
Done.

[('Date', 'TEXT', 4),
 ('Time (UTC)', 'TEXT', 4),
 ('Booster_Version', 'TEXT', 4),
 ('Launch_Site', 'TEXT', 4),
 ('Payload', 'TEXT', 4),
 ('PAYLOAD_MASS__KG_', 'REAL', 4),
 ('Orbit', 'TEXT', 4),
 ('Customer', 'TEXT', 4),
 ('Mission_Outcome', 'TEXT', 4),
 ('Landing_Outcome', 'TEXT', 4)]

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [10]:
%sql select distinct "Launch_Site" from SPACEXTBL

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',),
 ('VAFB SLC-4E',),
 ('KSC LC-39A',),
 ('CCAFS SLC-40',),
 (None,)]


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [11]:
%sql select * from SPACEXTBL where "Launch_Site" like 'CCA%' limit 5

 * sqlite:///my_data1.db
Done.

[('06/04/2010', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0.0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('12/08/2010', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0.0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('22/05/2012', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525.0, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('10/08/2012', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500.0, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('03/01/2013', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677.0, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [13]:
%sql select SUM(PAYLOAD_MASS__KG_) as total_payload_mass from SPACEXTBL where "Customer" = 'NASA (CRS)'

 * sqlite:///my_data1.db
Done.

[(45596.0,)]

For checking purpose:

In [17]:
%sql select sum(PAYLOAD_MASS__KG_) as total_payload_mass, "Customer" from SPACEXTBL group by "Customer";  --to check

 * sqlite:///my_data1.db
Done.

[(None, None),
 (7759.0, 'ABS Eutelsat'),
 (8963.0, 'AsiaSat'),
 (3669.0, 'Bulsatcom'),
 (3000.0, 'CONAE'),
 (3130.0, 'CONAE, PlanetIQ, SpaceX'),
 (4200.0, 'Canadian Space Agency (CSA)'),
 (5600.0, 'EchoStar'),
 (5300.0, 'Es hailSat'),
 (2150.0, 'Hisdesat exactEarth SpaceX'),
 (6092.0, 'Hispasat  NovaWurks'),
 (6070.0, 'Inmarsat'),
 (6761.0, 'Intelsat'),
 (67200.0, 'Iridium Communications'),
 (6460.0, 'Iridium Communications GFZ ‚ NASA'),
 (3500.0, 'KT Corporation'),
 (500.0, 'MDA'),
 (12055.0, 'NASA (CCD) '),
 (12530.0, 'NASA (CCDev)'),
 (12500.0, 'NASA (CCP)'),
 (525.0, 'NASA (COTS)'),
 (0.0, 'NASA (COTS) NRO'),
 (45596.0, 'NASA (CRS)'),
 (2617.0, 'NASA (CRS), Kacific 1'),
 (12050.0, 'NASA (CTS)'),
 (362.0, 'NASA (LSP)'),
 (553.0, 'NASA (LSP) NOAA CNES'),
 (1192.0, 'NASA / NOAA / ESA / EUMETSAT'),
 (5300.0, 'NRO'),
 (475.0, 'NSPO'),
 (5000.0, 'Northrop Grumman'),
 (3350.0, 'Orbcomm'),
 (4850.0, 'PSN, SpaceIL / IAI'),
 (5500.0, 'Republic of Korea Army, Spaceflight Industries (BlackSky)'),
 (23355.0, 'SES'),
 (5200.0, 'SES EchoStar'),
 (9296.0, 'SKY Perfect JSAT Group'),
 (6956.0, 'Sky Perfect JSAT, Kacific 1'),
 (185220.0, 'SpaceX'),
 (31010.0, 'SpaceX, Planet Labs'),
 (15440.0, 'SpaceX, Planet Labs, PlanetIQ'),
 (14932.0, 'SpaceX, Spaceflight Industries (BlackSky), Planet Labs'),
 (6500.0, 'Spacecom'),
 (4000.0, 'Spaceflight Industries'),
 (14135.0, 'Telesat'),
 (5800.0, 'Telkom Indonesia'),
 (6425.0, 'Thaicom'),
 (3600.0, 'Thales-Alenia/BTRC'),
 (4707.0, 'Turkmenistan National Space Agency'),
 (4990.0, 'U.S. Air Force'),
 (570.0, 'U.S. Air Force NASA NOAA'),
 (4311.0, 'U.S. Space Force'),
 (4400.0, 'USAF'),
 (4311.0, 'USSF')]

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [18]:
%sql select avg(PAYLOAD_MASS__KG_) as avg_payload_mass from SPACEXTBL where "Booster_Version" like 'F9 v1.1%'

 * sqlite:///my_data1.db
Done.

[(2534.6666666666665,)]

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [23]:
%%sql
select min(substr(Date,7,4) || substr(Date,4,2) || substr(Date,1,2)) as "1st successful landing (ground pad)" from SPACEXTBL 
    where "Landing_Outcome" = 'Success (ground pad)'

 * sqlite:///my_data1.db
Done.

[('20151222',)]

In [37]:
%%sql
select min(substr(Date,7,4)||'-'||substr(Date,4,2)||'-'||substr(Date,1,2)) as "1st successful landing (ground pad)" from SPACEXTBL 
    where "Landing_Outcome" = 'Success (ground pad)'

 * sqlite:///my_data1.db
Done.

[('2015-12-22',)]

Above used substr() because sqlite does not have a date type. See https://www.sqlite.org/datatype3.html#date_and_time_datatype.

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [25]:
%%sql
select "Booster_Version",PAYLOAD_MASS__KG_ from SPACEXTBL
    where "Landing_Outcome" = 'Success (drone ship)'
     and PAYLOAD_MASS__KG_ between 4000 and 6000

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022', 4696.0),
 ('F9 FT B1026', 4600.0),
 ('F9 FT  B1021.2', 5300.0),
 ('F9 FT  B1031.2', 5200.0)]

### Task 7




##### List the total number of successful and failure mission outcomes

In [29]:
%sql select "Mission_Outcome", count(*) as total_mission_outcome from SPACEXTBL group by "Mission_Outcome"

 * sqlite:///my_data1.db
Done.

[(None, 898),
 ('Failure (in flight)', 1),
 ('Success', 98),
 ('Success ', 1),
 ('Success (payload status unclear)', 1)]

In [30]:
%%sql 
select count(*) as total_success_mission from SPACEXTBL  
    where "Mission_Outcome" like '%Success%'

 * sqlite:///my_data1.db
Done.

[(100,)]

In [31]:
%%sql 
select count(*) as total_fail_mission from SPACEXTBL  
    where "Mission_Outcome" like '%Failure%'

 * sqlite:///my_data1.db
Done.

[(1,)]

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [32]:
%%sql
select "Booster_Version", PAYLOAD_MASS__KG_ from SPACEXTBL
    where PAYLOAD_MASS__KG_ = 
        (select max(PAYLOAD_MASS__KG_) from SPACEXTBL)

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4', 15600.0),
 ('F9 B5 B1049.4', 15600.0),
 ('F9 B5 B1051.3', 15600.0),
 ('F9 B5 B1056.4', 15600.0),
 ('F9 B5 B1048.5', 15600.0),
 ('F9 B5 B1051.4', 15600.0),
 ('F9 B5 B1049.5', 15600.0),
 ('F9 B5 B1060.2 ', 15600.0),
 ('F9 B5 B1058.3 ', 15600.0),
 ('F9 B5 B1051.6', 15600.0),
 ('F9 B5 B1060.3', 15600.0),
 ('F9 B5 B1049.7 ', 15600.0)]

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 4, 2) as month to get the months and substr(Date,7,4)='2015' for year.**

In [34]:
%%sql
select substr(Date, 4, 2) as month, "Landing_Outcome", "Booster_Version", "Launch_Site" from SPACEXTBL
    where substr(Date,7,4)='2015'
     and "Landing_Outcome" = 'Failure (drone ship)'

 * sqlite:///my_data1.db
Done.

[('10', 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('04', 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40')]

### Task 10




##### Rank the  count of  successful landing_outcomes between the date 04-06-2010 and 20-03-2017 in descending order.

In [41]:
%%sql
select "Landing_Outcome",count(*) as LANDING_OUTCOME_COUNT
    from SPACEXTBL 
    where  (substr(Date,7,4)||'-'||substr(Date,4,2)||'-'||substr(Date,1,2)) between '2010-06-04' and '2017-03-20' 
    group by "Landing_Outcome"
    order by LANDING_OUTCOME_COUNT desc

 * sqlite:///my_data1.db
Done.

[('No attempt', 10),
 ('Success (ground pad)', 5),
 ('Success (drone ship)', 5),
 ('Failure (drone ship)', 5),
 ('Controlled (ocean)', 3),
 ('Uncontrolled (ocean)', 2),
 ('Precluded (drone ship)', 1),
 ('Failure (parachute)', 1)]

In [42]:
%%sql
select "Landing_Outcome",count(*) as LANDING_OUTCOME_COUNT
    from SPACEXTBL 
    where  (substr(Date,7,4)||'-'||substr(Date,4,2)||'-'||substr(Date,1,2)) between '2010-06-04' and '2017-03-20'
     and "Landing_Outcome" like '%Success%'
    group by "Landing_Outcome"
    order by LANDING_OUTCOME_COUNT desc

 * sqlite:///my_data1.db
Done.

[('Success (ground pad)', 5), ('Success (drone ship)', 5)]

In [43]:
%%sql
select "Landing_Outcome", Date from SPACEXTBL
    where  (substr(Date,7,4)||'-'||substr(Date,4,2)||'-'||substr(Date,1,2)) between '2010-06-04' and '2017-03-20'
     and "Landing_Outcome" like '%Success%'

 * sqlite:///my_data1.db
Done.

[('Success (ground pad)', '22/12/2015'),
 ('Success (drone ship)', '04/08/2016'),
 ('Success (drone ship)', '05/06/2016'),
 ('Success (drone ship)', '27/05/2016'),
 ('Success (ground pad)', '18/07/2016'),
 ('Success (drone ship)', '14/08/2016'),
 ('Success (drone ship)', '14/01/2017'),
 ('Success (ground pad)', '19/02/2017'),
 ('Success (ground pad)', '05/01/2017'),
 ('Success (ground pad)', '06/03/2017')]

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |

## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>